# Insulation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Insulation Property
GroupTypeId Class See Also
---
Insulation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Insulation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Insulation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Insulation {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace